NguyenCongChinh28/DATN_CHUONG_BAO_CHAY/update1/stm32/BST01_Lamp_Button/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BT_ALARM_Pin GPIO_PIN_1
#define BT_ALARM_GPIO_Port GPIOA
#define BT_PAIR_Pin GPIO_PIN_2
#define BT_PAIR_GPIO_Port GPIOA
#define LORA_SPI_CS_Pin GPIO_PIN_4
#define LORA_SPI_CS_GPIO_Port GPIOA
#define LORA_DIO1_ISR_Pin GPIO_PIN_4
#define LORA_DIO1_ISR_GPIO_Port GPIOC
#define LORA_DIO1_ISR_EXTI_IRQn EXTI4_IRQn
#define LORA_DIO2_Pin GPIO_PIN_5
#define LORA_DIO2_GPIO_Port GPIOC
#define LORA_DIO3_Pin GPIO_PIN_0
#define LORA_DIO3_GPIO_Port GPIOB
#define LORA_RESET_PIN_Pin GPIO_PIN_1
#define LORA_RESET_PIN_GPIO_Port GPIOB
#define LORA_BUSY_Pin GPIO_PIN_2
#define LORA_BUSY_GPIO_Port GPIOB
#define BUZZER_Pin GPIO_PIN_12
#define BUZZER_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
